# Create Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
GenericZone..::..Create Method
GenericZone Class See Also
---
Creates a new instance of a generic zone and adds it to the document.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public static GenericZone Create(
	Document doc,
	string name,
	GenericZoneDomainData domainData,
	ElementId levelId,
	IList<CurveLoop> curveLoops
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	doc As Document, _
	name As String, _
	domainData As GenericZoneDomainData, _
	levelId As ElementId, _
	curveLoops As IList(Of CurveLoop) _
) As GenericZone
```

Visual C++
---
```text
public:
static GenericZone^ Create(
	Document^ doc,
	String^ name,
	GenericZoneDomainData^ domainData,
	ElementId^ levelId,
	IList<CurveLoop^>^ curveLoops
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document The document where the element will be created and added.
name
    Type: System..::..String The name of the generic zone to be created.
domainData
    Type: Autodesk.Revit.DB.Analysis..::..GenericZoneDomainData The specific domain requirements for the generic zone.
levelId
    Type: Autodesk.Revit.DB..::..ElementId The base level on which the generic zone will be created.
curveLoops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)> The loops that define the lines, curves and areas that overlap or crosses the elements you want to belong to the zone. Multiple loops are allowed, they can be open or closed, but they should be on the same horizontal plane.
# ### Return Value
The newly created generic zone.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | name cannot include prohibited characters. -or- name is an empty string. -or- The ElementId levelId is not a Level. -or- The curve loops in the input array are empty. -or- The input curve loops do not all lie in the same horizontal plane. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| Autodesk.Revit.Exceptions..::..ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions..::..ModificationOutsideTransactionException | The document has no open transaction. |

# See Also
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace